# ConstructionMethod Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsType..::..ConstructionMethod Property
StairsType Class See Also
---
The construction method of the stairs.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public StairsConstructionMethod ConstructionMethod { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ConstructionMethod As StairsConstructionMethod
	Get
```

Visual C++
---
```text
public:
property StairsConstructionMethod ConstructionMethod {
	StairsConstructionMethod get ();
}
```

# See Also
StairsType Class
Autodesk.Revit.DB.Architecture Namespace